#include <Windows.h>


// оце -- віндовий main()
int WINAPI WinMain(	
	 HINSTANCE	hInstance	// хендл на екземпляр програми
	,HINSTANCE	hPrev		// не використовується, зберігають для сумісності
	,LPSTR		szCmdLine	// сюдою система передає командний рядок
	,int		iCmdShow	// ним система вказує, в якому стані має відкритися гловне вікно
	)
{
	// найпростіше вікно :)
	MessageBox(		 NULL				// хендл головного вікна
					,L"Працює !!!!!"	// текст у вікні
					,L"Уря-я-а-а-а!"	// текст заголовку
					,0					// визначає вигляд і поведінку вікна
				);


	return 0;
}